openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/









/* CONFIGURATION NOTES
 * ------------------------------------------------------------------
 * The configuration for this module should be supplied by
 * the users of it ( see 10.4 Configuration concept )
 *
 * ALT configuration method:
 *   The method that is used today keeps the configuration in the spi_cfg files.
 *   That is not good..
 *
 *   Could do something like:
 *     SPI_ADD_CONFIG(Eep_SpiConfig)
 *   in each place a configuration needs to be added to Spi.
 *   The macro adds the pointer to a ptr list( .spi_config section )
 *
 *   Problems: Sequence/job ID's must be global
 *   --> Hhmm skip this for now, gets VERY complicated
 *
 */

/* IMPLEMENTATION NOTES
 * -----------------------------------------------
 * - This driver implements SPI_LEVEL_DELIVERED = 2 but with a number
 *   of restrictions. See REQ. below for more information.
 *
 * - A sequence may use different CS's if the controller is the same.
 *   ( All jobs that belongs to a sequence MUST share the same controller )
 *
 * - The driver uses Spi_DataType as uint8. This means that an 16-bit address have
 *   a length of 2 when setting upASetting async/sync mode is not supported
 *   ( Spi_SetAsyncMode(), SPI188, etc )
 * - Cancel API is NOT supported
 *    ( SPI_CANCEL_API must be STD_OFF )
 *
 * - It's not obvious how to use different modes. My interpretation:
 *
 *   Sync
 *     Always blocking in Spi_SyncTranmit()
 *
 *   Async and INTERRUPT
 *
 *   Async and POLLING
 *     Not supported since
 *
 * - Some sequence charts
 *
 *
 * == Sync ==
 *       WriteSeq   ISR   WriteJob   MainFunction_Driving
 *       -------------------------------------------------
 *       |          |
 * ------>
 *       ---------------->
 *       <---------------
 * ( for each job we will now get an interrupt that write's the next job)
 *                  ----->
 *                  <-----
 *                  ...
 * <-----
 *
 * == Async and INTERRUPT ==
 *
 * ------>
 *       ---------------->
 *       <---------------
 * <-----
 * ( for each job we will now get an interrupt that write's the next job)
 *                  ----->
 *                  <-----
 *       ....
 *
 *
 * == Async and POLLING ==
 * ( Not supported yet )
 *
 * ------>
 *       ---------------->
 *       <---------------
 * <-----
 * ( for each job in the sequence the sequence must be repeated )
 * ---------------------------------->
 *                 <-----------------
 *                 ------>
 *                 <-----
 *                 ------------------>
 * <----------------------------------
 * ...
 *
 *
 */

/* HW INFO
 * -----------------------------------------------
 * 4 DSPI modules, A,B,C and D
 * 7 CTAR's for each module.( data-width, baudrate )
 *
 */

/* NOTIFICATION INFORMATION
 * -----------------------------------------------
 *
 * There's a LOT of status and notification in this module....
 *
 *                           Job1              Job2
 *                     |---------------|---------------|
 *                                    JN              JN,SN
 * Status    IDLE             BUSY           BUSY           IDLE
 * HwStatus  IDLE             BUSY           BUSY           IDLE
 * JobResult JOB_OK      JOB_PENDING       JOB_PENDING      JOB_OK,SPI_JOB_FAILED
 * SeqResult SEQ_OK      SEQ_PENDING       SEQ_PENDING      SEQ_OK,SEQ_FAILED,SEQ_CANCELLED
 *
 */


#include "Spi.h"
#include "mpc55xx.h"
//#include <stdio.h>
#include "Mcu.h"
#include "math.h"
#include "Dma.h"
#include <assert.h>
#include <limits.h>
#include "Det.h"
#include <stdlib.h>
#include "isr.h"

//#define USE_LDEBUG_PRINTF	1
#undef DEBUG_LVL
#define DEBUG_LVL DEBUG_HIGH
#include "debug.h"

#define STEP_VALIDATION		1

#define MODULE_NAME 	"/driver/Spi"

#define GET_SPI_HW_PTR(_unit) 	\
        ((volatile struct DSPI_tag *)(0xFFF90000 + 0x4000*(_unit)))

#define GET_SPI_UNIT_PTR(_unit) &Spi_Unit[_unit]

#define ENABLE_EOQ_INTERRUPT(_spi_hw) _spi_hw->RSER.B.EOQF_RE = 1
#define DISABLE_EOQ_INTERRUPT(_spi_hw) _spi_hw->RSER.B.EOQF_RE = 0

/* Development error macros. */
#if ( SPI_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_SPI,0,_api,_err); \
          return; \
        }

#define VALIDATE_W_RV(_exp,_api,_err,_rv ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_SPI,0,_api,_err); \
          return (_rv); \
        }
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_W_RV(_exp,_api,_err,_rv )
#endif

#define NOT_VALID 	(-1)

typedef union
{
  vuint32_t R;
  struct {
  vuint32_t CONT:1;
  vuint32_t CTAS:3;
  vuint32_t EOQ:1;
  vuint32_t CTCNT:1;
    vuint32_t:4;
  vuint32_t PCS5:1;
  vuint32_t PCS4:1;
  vuint32_t PCS3:1;
  vuint32_t PCS2:1;
  vuint32_t PCS1:1;
  vuint32_t PCS0:1;
  vuint32_t TXDATA:16;
  } B;
}SPICommandType;

typedef SPICommandType Spi_CommandType;



/* Templates for Rx/Tx DMA structures */
Dma_TcdType Spi_DmaTx =
{

    .SADDR = 0,
    .SMOD = 0,
    .SSIZE = DMA_TRANSFER_SIZE_32BITS,
    .DMOD = 0,
    .DSIZE = DMA_TRANSFER_SIZE_32BITS,
    .SOFF = 4,
    .NBYTESu = 4,
    .SLAST = 0,
    .DADDR = 0,
    .CITERE_LINK = 0,
    .CITER = 0,
    .DOFF = 0,
    .DLAST_SGA = 0,
    .BITERE_LINK = 0,
    .BITER = 0,
    .BWC = 0,
    .MAJORLINKCH = 0,
    .DONE = 0,
    .ACTIVE = 0,
    .MAJORE_LINK = 0,
    .E_SG = 0,
    .D_REQ = 0,
    .INT_HALF = 0,
    .INT_MAJ = 0,
    .START = 0
};

