openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
Dma_TcdType Spi_DmaRx =
{
    .SADDR = 0,
    .SMOD = 0,
    .SSIZE = DMA_TRANSFER_SIZE_32BITS,
    .DMOD = 0,
    .DSIZE = DMA_TRANSFER_SIZE_32BITS,
    .SOFF = 0,
    .NBYTESu = 4,
    .SLAST = 0,
    .DADDR = 0,
    .CITERE_LINK = 0,
    .CITER = 1,
    .DOFF = 4,
    .DLAST_SGA = 0,
    .BITERE_LINK = 0,
    .BITER = 1,
    .BWC = 0,
    .MAJORLINKCH = 0,
    .DONE = 0,
    .ACTIVE = 0,
    .MAJORE_LINK = 0,
    .E_SG = 0,
    .D_REQ = 0,
    .INT_HALF = 0,
#if defined(__DMA_INT)
    .INT_MAJ = 1,
#else
    .INT_MAJ = 0,
#endif
    .START = 0
};

#define GET_HW(_channel)    ( volatile struct DSPI_tag *)((uint32)&DSPI_A + 0x4000 * _channel )



typedef struct {
	// Pointer to source buffer
	const Spi_DataType *src;
	// Pointer to destination buffer
	Spi_DataType *dest;
	// Number of elements of Spi_DataType in destination buffer
	Spi_NumberOfDataType length;
	// Set if the buffer is configured.
	// Used for sanity check
	_Bool active;
} Spi_EbType;

typedef enum {
	SPI_ASYNC,
	SPI_SYNC,
} Spi_CallTypeType;


Spi_EbType Spi_Eb[SPI_MAX_CHANNEL];

typedef struct {
	// this channel is assigned to this CTAR
	uint8 ctarId;
} Spi_ChannelInfoType;

Spi_ChannelInfoType Spi_ChannelInfo[SPI_MAX_CHANNEL];

// E2 read = cmd + addr + data = 1 + 2 + 64 ) = 67 ~ 72
#define SPI_INTERNAL_MTU    72

/**
 * This structure represents a controller unit
 */
typedef struct {

	// Tx DMA channel information
	Dma_ChannelType dmaTxChannel;
	Dma_TcdType dmaTxTCD;

	// Rx DMA channel information
	Dma_ChannelType dmaRxChannel;
	Dma_TcdType dmaRxTCD;

	// Pointed to by SADDR of DMA
	Spi_CommandType txQueue[SPI_INTERNAL_MTU];
	// Pointed to by DADDR of DMA
	uint32          rxQueue[SPI_INTERNAL_MTU];

	// current index for data when sending
	// mostly here for debug purposes( since it could be local )
	uint32 txCurrIndex;

	// Helper array to assign CTAR's
	uint32     channelCodes[7];

	// Status for this unit
	Spi_StatusType status;

	// The current job
	const Spi_JobConfigType *currJob;
	// Points array of jobs current
	const Spi_JobType *currJobIndexPtr;
	// The Sequence
	const Spi_SequenceConfigType *currSeqPtr;

	// Used by sync call to check when a job is done
	//    volatile _Bool done;

	// 1 -  if the current job is sync. 0 - if not
	Spi_CallTypeType callType;
} Spi_UnitType;

typedef struct {
	Spi_SeqResultType seqResult;
} Spi_SeqUnitType;

typedef struct {
	Spi_JobResultType jobResult;
} Spi_JobUnitType;

typedef struct {
  // Initially FALSE set to TRUE if Spi_Init() have been called
  boolean initRun;

  // Pointer to the configuration
  const Spi_ConfigType *configPtr;

  // Pointer to the external buffers
  Spi_EbType *extBufPtr;

  Spi_ChannelInfoType *channelInfo;

  // Mask if the HW unit is configured or not
  uint32 spiHwConfigured;

  Spi_AsyncModeType asyncMode;

  /* This is a bunch of debug counters. */
  uint32 totalNbrOfTranfers;
  uint32 totalNbrOfStartedJobs;
  /* Counters for busy waiting for DSPI and DMA. */
  uint32 totalNbrOfWaitTXRXS;
  uint32 totalNbrOfWaitRxDMA;

#if  defined(STEP_VALIDATION)
  int eoqf_cnt;
  int txrxs_cnt;
  uint32_t dma_status;

  volatile struct EDMA_tag *dmaHwPtr;
#endif

} Spi_GlobalType;

//
// Instances
//
Spi_GlobalType Spi_Global = {
    .initRun = FALSE,
    .asyncMode = SPI_INTERRUPT_MODE, // TODO: according to SPI151 it should be polling
#if  defined(STEP_VALIDATION)
    .dmaHwPtr = (volatile struct EDMA_tag *)0xFFF44000UL,
#endif
};

Spi_UnitType Spi_Unit[4];
Spi_SeqUnitType Spi_SeqUnit[SPI_MAX_SEQUENCE];
Spi_JobUnitType Spi_JobUnit[SPI_MAX_JOB];

static void Spi_Isr( uint32 );

static void Spi_Isr_A( void ) { Spi_Isr(DSPI_CTRL_A); }
static void Spi_Isr_B( void ) { Spi_Isr(DSPI_CTRL_B); }
static void Spi_Isr_C( void ) { Spi_Isr(DSPI_CTRL_C); }
static void Spi_Isr_D( void ) { Spi_Isr(DSPI_CTRL_D); }

#if 0
static void Spi_Isr_DMA( void )
{
	// Clear interrupt
	Dma_ClearInterrupt(5);
}
#endif


static void Spi_JobWrite( Spi_JobType jobIndex );



static void Spi_SetJobResult( Spi_JobType Job, Spi_JobResultType result  )
{
  Spi_JobUnit[Job].jobResult = result;
}

static void Spi_SetHWUnitStatus(Spi_HWUnitType HWUnit,Spi_StatusType status )
{
  Spi_Unit[HWUnit].status = status;
}

/**
 * Get external Ptr to device from index
 *
 * @param deviceType The device index.
 * @return Ptr to the external device
 */

static inline const Spi_ExternalDeviceType *Spi_GetExternalDevicePtrFromIndex( Spi_ExternalDeviceTypeType deviceType ) {
  return (&(Spi_Global.configPtr->SpiExternalDevice[(deviceType)]));
}

/**
 * Get configuration job ptr from job index
 * @param jobIndex the job
 * @return Ptr to the job configuration
 */
static const Spi_JobConfigType *Spi_GetJobPtrFromIndex( Spi_JobType jobIndex ) {
  return &Spi_Global.configPtr->SpiJobConfig[jobIndex];
}

/**
 * Get sequence ptr from sequence index
 * @param seqIndex the sequence
 * @return Ptr to the sequence configuration
 */
static const Spi_SequenceConfigType *Spi_GetSeqPtrFromIndex( Spi_SequenceType SeqIndex ) {
  return &Spi_Global.configPtr->SpiSequenceConfig[SeqIndex];
}

/**
 * Get unit ptr from unit index
 * @param unit the unit
 * @return Ptr to the SPI unit
 */
static Spi_UnitType *Spi_GetUnitPtrFromIndex( uint32 unit ) {
  return &Spi_Unit[unit];
}

/**
 * Function to see if two sequences share jobs
 * @param seq - Seqence 1
 * @param seq - Seqence 2
 * @return 0 - if the don't share any jobs
 *        !=0 - if they share jobs
 */

static boolean Spi_ShareJobs(Spi_SequenceType seq1, Spi_SequenceType seq2 ) {
  uint32 seqMask1 = 0;
  uint32 seqMask2 = 0;
  const Spi_JobType *jobPtr;
  const Spi_SequenceConfigType *seqConfig;

  // Search for jobs in sequence 1
  seqConfig = Spi_GetSeqPtrFromIndex(seq1);
  jobPtr = &seqConfig->JobAssignment[0];

  while( *jobPtr != NOT_VALID ) {
    assert(*jobPtr<31);
    seqMask1 |= (1<<*jobPtr);
    jobPtr++;
  }

  // Search for jobs in sequence 2
  seqConfig = Spi_GetSeqPtrFromIndex(seq2);
  jobPtr = &seqConfig->JobAssignment[0];

  while( *jobPtr != NOT_VALID ) {
    assert(*jobPtr<31);
    seqMask2 |= (1<<*jobPtr);
    jobPtr++;
  }

  return (seqMask1 & seqMask2 );
}

//-------------------------------------------------------------------

/**
 * Sets a result for a sequence
 *
 * @param Sequence The sequence to set the result for
 * @param result The result to set.
 */
static void Spi_SetSequenceResult(Spi_SequenceType Sequence, Spi_SeqResultType result ) {
	Spi_SeqUnit[Sequence].seqResult = result;
}

//-------------------------------------------------------------------


/**
 * Gets the next job to do
 *
 * @param spiUnit The SPI unit
 * @return The job ID. -1 if no more jobs
 */
static Spi_JobType Spi_GetNextJob(Spi_UnitType *spiUnit ) {
	spiUnit->currJobIndexPtr++;
	return *(spiUnit->currJobIndexPtr);
}
//-------------------------------------------------------------------

/**
 * Schedules next job to do( calls Spi_jobWrite() or not )
 *
 * @param spiUnit The SPI unit
 */
static int Spi_WriteNextJob( Spi_UnitType *spiUnit ) {
	Spi_JobType nextJob;
	// Re-cap.
	// - Jobs have the controller
	// - Sequences can we interruptible between jobs.
	// But
	// According to SPI086 you can't share a job with a sequence that
	// is in SPI_SEQ_PENDING ( that happens first thing at Spi_AsyncTranmit() )
	//
	// So, I no clue what to use the priority thing for :(

	nextJob = Spi_GetNextJob(spiUnit);
	if( (int)nextJob == NOT_VALID) {
	  return NOT_VALID;

	} else {
		// Schedule next job
		Spi_JobWrite(nextJob);
	}
	return 0;
}

//-------------------------------------------------------------------

/**
 * Function to handle things after a transmit on the SPI is finished.
 * It copies data from it't local buffers to the buffers pointer to
 * by the external buffers
 *
 * @param spiUnit Ptr to a SPI unit
 */

static int Spi_PostTransmit( Spi_UnitType *spiUnit ) {
	_Bool printedSomeThing = 0;

