openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	/* Stop the channels */
	Dma_StopChannel (spiUnit->dmaTxChannel);
	Dma_StopChannel (spiUnit->dmaRxChannel);

	ramlog_str("PostTransmit Job: ");
	ramlog_dec(spiUnit->currJob->SpiJobId);
	ramlog_str("\n");

	/* Copy data from RX queue to the external buffer( if a<uny ) */
	{
		int j=0;
		int currIndex =0;
		int channelIndex;
		const Spi_ChannelConfigType *chConfig;
		Spi_EbType *extChBuff;
		int gotTx;
		int sentTx;

		// Check that we got the number of bytes we sent
		sentTx = spiUnit->txCurrIndex+1;
		gotTx = (Dma_GetTcd(spiUnit->dmaRxChannel)->DADDR - (uint32)&spiUnit->rxQueue[0])/sizeof(uint32);

		if( sentTx != gotTx ) {
		  // Something failed
		  DEBUG(DEBUG_LOW,"%s: Expected %d bytes. Got %d bytes\n ",MODULE_NAME,sentTx, gotTx );
		  return (-1);
		} else {
		  ramlog_str("Rx ");
		  ramlog_dec(gotTx);
		  ramlog_str(" Bytes\n");
		  DEBUG(DEBUG_LOW,"%s: Got %d bytes\n",MODULE_NAME,gotTx);
		}


		// Find the channels for this job
		while( (channelIndex = spiUnit->currJob->ChannelAssignment[j++]) != NOT_VALID)
		{
			chConfig = &Spi_Global.configPtr->SpiChannelConfig[channelIndex];

			/* Check configuration error */
#if ( SPI_CHANNEL_BUFFERS_ALLOWED == 1  )
			assert( chConfig->SpiChannelType == SPI_EB );
#endif

			// Send the channels that are setup with external buffers
			// Get the external buffer for this channel
			extChBuff = &Spi_Global.extBufPtr[channelIndex];
			if( extChBuff->dest != NULL ) {
				// Note! No support for >8 "data"
				for(int k=0;k<extChBuff->length;k++) {
					extChBuff->dest[k] = spiUnit->rxQueue[currIndex++];
					DEBUG(DEBUG_LOW," %02x ",extChBuff->dest[k]);
					printedSomeThing = 1;
				}

			} else {
				if( chConfig->SpiDataWidth > 8 ) {
					currIndex += (extChBuff->length/2);
				} else {
					currIndex += extChBuff->length;
				}
			}
		}
		if( printedSomeThing )
			DEBUG(DEBUG_LOW,"\n");
	}

	return 0;
}

//-------------------------------------------------------------------

/**
 * ISR for End of Queue interrupt
 *
 * @param unit The HW unit it happend on
 */
static void Spi_Isr( uint32 unit ) {
	volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);
	Spi_UnitType *spiUnit = GET_SPI_UNIT_PTR(unit);
	int rv;

	ramlog_str("Spi_Isr\n");

	// This may seem pretty stupid to wait for the controller
	// to shutdown here, but there seems to be no other way to do this.
	// Reasons:
	// - Waiting for DMA rx/tx hits earlier than EOQ.
	// - Other interrupts from SPI all hit earlier than EOQ.

	// TODO: We could implement a timeout here and fail the job
	// if this never happens.

	// This is the busy wait when called from a non-interrupt context
  while (spiHw->SR.B.TXRXS) {
    Spi_Global.totalNbrOfWaitTXRXS++;
  }

  // To be 100% sure also wait for the DMA transfer to complete.
  while(!Dma_ChannelDone (Spi_Global.configPtr->SpiHwConfig[unit].RxDmaChannel))
  {
    Spi_Global.totalNbrOfWaitRxDMA++;
  }

  /* Halt DSPI unit until we are ready for next transfer. */
  spiHw->MCR.B.HALT = 1;
  spiHw->SR.B.EOQF = 1;

  Spi_Global.totalNbrOfTranfers++;

	// Disable EOQ interrupts
  // NOTE!
  //   This does NOT clear the interrupt request.
  //   That can only be done by clearing( setting ) the EOQ
  //   bit.. but that also triggers a new transfer.
  //
  // ALT
  //   A possibility could be to use the HALT bit instead of
  //   using this trick, but hey, this works

  DISABLE_EOQ_INTERRUPT(spiHw);

  // Update external buffers
  rv = Spi_PostTransmit(spiUnit);

	// Call notification end
	if(spiUnit->currJob->SpiJobEndNotification != NULL ) {
		spiUnit->currJob->SpiJobEndNotification();
	}

	if( rv == (-1) )
	{
	  // Fail both job and sequence
	  Spi_SetHWUnitStatus(unit,SPI_IDLE);
	  Spi_SetJobResult(spiUnit->currJob->SpiJobId,SPI_JOB_FAILED);
	  Spi_SetSequenceResult(spiUnit->currSeqPtr->SpiSequenceId,SPI_SEQ_FAILED);
	}
	else
	{

		// The job is at least done..
		Spi_SetJobResult(spiUnit->currJob->SpiJobId,SPI_JOB_OK);

		// WriteNextJob should
		// 1. Update the JobResult to SPI_JOB_OK
		// 2. Update the HWUnit status to IDLE

		if( Spi_WriteNextJob(spiUnit) == (-1))
		{
			// No more jobs, so set HwUnit and sequence IDLE/OK also.
			Spi_SetHWUnitStatus(unit,SPI_IDLE);
			Spi_SetSequenceResult(spiUnit->currSeqPtr->SpiSequenceId, SPI_SEQ_OK);

			if( spiUnit->currSeqPtr->SpiSeqEndNotification != NULL ) {
				spiUnit->currSeqPtr->SpiSeqEndNotification();
			}

			Spi_SetHWUnitStatus(unit,SPI_IDLE);

			/* We are now ready for next transfer. */
		  spiHw->MCR.B.HALT = 1;

			ramlog_str("NO more jobs\n");
		} else {
      ramlog_str("More jobs\n");
		}
	}

	ramlog_str("Spi_Isr END\n");
}

//-------------------------------------------------------------------

Std_ReturnType Spi_WriteIB( Spi_ChannelType Channel, const Spi_DataType *DataBufferPtr ){
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_WRITEIB_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
  VALIDATE_W_RV( ( Channel<SPI_MAX_CHANNEL ), SPI_WRITEIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
  VALIDATE_W_RV( ( DataBufferPtr != NULL ), SPI_WRITEIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
  VALIDATE_W_RV( ( SPI_IB==Spi_Global.configPtr->SpiChannelConfig[Channel].SpiChannelType ),\
      SPI_WRITEIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
  Std_ReturnType rv = E_NOT_OK;
  return rv;
}

/* Clock tables */
uint32 clk_table_asc[] =    {2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536 };
uint32 clk_table_cssck[] =  {2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768,65536 };
uint16 clk_table_br[] =     {2,4,6,8,16,32,64,128,256,512,1024,2048,4096,8192,16384,32768 };
uint8  clk_table_pasc[] =   { 1,3,5,7 };
uint8  clk_table_pcssck[] = { 1,3,5,7 };
uint8  clk_table_pbr[] =    { 2,3,5,7 };

/**
 * Function to setup CTAR's from configuration
 * @param spiHw - Pointer to HW SPI device
 * @param extDev - Pointer to external device configuration
 * @param ctar_unit - The ctar unit number to setup
 * @param width - The width in bits of the data to send with the CTAR
 */
static void Spi_SetupCTAR( Spi_HWUnitType unit,
                              const Spi_ExternalDeviceType *extDev,
                              Spi_ChannelType ctar_unit,
                              uint8 width )
{
	uint32 clock;
	uint32 pre_br;
	int i;
	int j;
	uint32 tmp;

	volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);
	/* BAUDRATE CALCULATION
	 * -----------------------------
	 * Baudrate = Fsys/ PBR * ( 1+ DBR) / BR
	 * PBR range: 2 to 7
	 * DBR range: 0 to 1
	 * BR : 2 to 32768
	 *
	 * To make this easy set DBR = 0 and PBR=2
	 * --> BR=Fsys/(Baudrate.* 2 )
	 *
	 */
	clock = McuE_GetPeripheralClock(Spi_Global.configPtr->SpiHwConfig[unit].PeripheralClock);
	DEBUG(DEBUG_MEDIUM,"%s: Peripheral clock at %d Mhz\n",MODULE_NAME,clock);

	DEBUG(DEBUG_MEDIUM,"%s: Want to run at %d Mhz\n",MODULE_NAME,extDev->SpiBaudrate);

