openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	spiHw->CTAR[ctar_unit].B.DBR = 0;
	spiHw->CTAR[ctar_unit].B.PBR = 0;	// 2
	pre_br = clock/(extDev->SpiBaudrate*clk_table_pbr[spiHw->CTAR[ctar_unit].B.PBR]);

	// find closest lesser
	for(i=0;i<sizeof(clk_table_br)/sizeof(clk_table_br[0]);i++) {
		if( clk_table_br[i] >= pre_br ) {
			break;
		}
	}

	assert(i>=0);
	// Set it
	spiHw->CTAR[ctar_unit].B.BR = i;

	DEBUG(DEBUG_LOW,"%s: CLK %d Mhz\n",MODULE_NAME,
			clock / clk_table_pbr[spiHw->CTAR[ctar_unit].B.PBR] *
			( 1 + spiHw->CTAR[ctar_unit].B.DBR)/clk_table_br[spiHw->CTAR[ctar_unit].B.BR]);


	/* For other timings autosar only specifies SpiTimeClk2Cs == "After SCK delay"
	 * in Freescale language. The dumb thing is that this should be a relative time
	 * to the clock. Not fixed.
	 * Autosar specifies 0.0--100.0 ms(float)
	 * Our intepretation is 0--1000000 ns (uint32)
	 *
	 * AFTER SCK DELAY:
	 * -----------------------------
	 * Tasc = 1/Fsys * PASC  * ASC [s]
	 *
	 * Assume the Tasc get's here in ns( typical range is ~10ns )
	 */

	// Calc the PASC * ASC value...
  tmp = extDev->SpiTimeClk2Cs * (clock / 1000000 );

	// Nothing fancy here...
	{
	  int best_i=0;
	  int best_j=0;
	  int b_value = INT_MAX;
	  int tt;


    // Find the best match of Prescaler and Scaler value
	  for(i=0;i<ARRAY_SIZE(clk_table_pasc);i++) {
	    for(j=0;j<ARRAY_SIZE(clk_table_asc);j++) {
	      tt = abs((int)clk_table_pasc[i]*clk_table_asc[j]*1000 - tmp);
	      if( tt < b_value ) {
	        best_i = i; best_j = j; b_value = tt;
	      }
	    }
	  }

	  /* After SCK delay. */
	   spiHw->CTAR[ctar_unit].B.PASC = best_i;
	   spiHw->CTAR[ctar_unit].B.ASC = best_j;
	}


	DEBUG(DEBUG_MEDIUM,"%s: Timing: Tasc %d ns\n",MODULE_NAME,
			clk_table_pasc[spiHw->CTAR[ctar_unit].B.PASC] *
			clk_table_asc[spiHw->CTAR[ctar_unit].B.ASC] * 1000/ (clock/1000000) );



  /* The PCS to SCK delay is the delay between the assertion of PCS and
   * the first edge the SCK.
   *
   * PCS TO SCK DELAY:
   * -----------------------------
   * Tcsc = 1/Fsys * PCSSCK * CSSCK [s]
   */

  // Calc the PCSSCK * CSSCK value...
  tmp = extDev->SpiTimeCs2Clk * (clock / 1000000 );

  // Nothing fancy here...
  {
    int best_i=0;
    int best_j=0;
    int b_value = INT_MAX;
    int tt;

    // Find the best match of Prescaler and Scaler value
    for(i=0;i<ARRAY_SIZE(clk_table_pcssck);i++) {
      for(j=0;j<ARRAY_SIZE(clk_table_cssck);j++) {
        tt = abs((int)clk_table_pcssck[i]*clk_table_cssck[j]*1000 - tmp);
        if( tt < b_value ) {
          best_i = i; best_j = j; b_value = tt;
        }
      }
    }

    /* PCS to SCK delay */
    spiHw->CTAR[ctar_unit].B.PCSSCK = best_i;
    spiHw->CTAR[ctar_unit].B.CSSCK = best_j;
  }


	DEBUG(DEBUG_MEDIUM,"%s: Timing: Tcsc %d ns\n",MODULE_NAME,
			clk_table_pcssck[spiHw->CTAR[ctar_unit].B.PCSSCK] *
			clk_table_cssck[spiHw->CTAR[ctar_unit].B.CSSCK]*1000/(clock/1000000));


	/* Time that PCS is high between transfers */
	spiHw->CTAR[ctar_unit].B.PDT = 2;
	spiHw->CTAR[ctar_unit].B.DT = 2;

	DEBUG(DEBUG_MEDIUM,"%s: Timing: Tdt  %d ns\n",MODULE_NAME,
			clk_table_pasc[spiHw->CTAR[ctar_unit].B.PDT] *
			clk_table_asc[spiHw->CTAR[ctar_unit].B.DT]*1000/(clock/1000000));

	/* Data is transferred MSB first */
	spiHw->CTAR[ctar_unit].B.LSBFE = 0;

	/* Set mode */
	spiHw->CTAR[ctar_unit].B.FMSZ = width - 1;
	spiHw->CTAR[ctar_unit].B.CPHA = ( extDev->SpiDataShiftEdge == SPI_EDGE_LEADING ) ?  0 : 1;
	spiHw->CTAR[ctar_unit].B.CPOL = ( extDev->SpiCsPolarity == STD_LOW ) ?  0 : 1;

	// This the ACTIVE polarity. Freescale have inactive polarity
	if( extDev->SpiCsPolarity == STD_HIGH ) {
		spiHw->MCR.R &= ~(1 <<(16+extDev->SpiCsIdentifier));
	} else {
		spiHw->MCR.R |= (1 <<(16+extDev->SpiCsIdentifier));
	}
}

//-------------------------------------------------------------------

static void Spi_InitController( uint32 unit ) {
	volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);
	Spi_UnitType *spiUnit = GET_SPI_UNIT_PTR(unit);

	/* Module configuration register. */
	/* Master mode. */
	spiHw->MCR.B.MSTR = 1;
	/* No freeze. Run SPI when debugger is stopped. */
	spiHw->MCR.B.FRZ = 0;
	/* PSC5 as regular CS. */
	spiHw->MCR.B.PCSSE = 0;

	/* Enable FIFO's. */
	spiHw->MCR.B.DIS_RXF = 1;
	spiHw->MCR.B.DIS_TXF = 1;

	/* Set all active low. */
	spiHw->MCR.B.PCSIS0 = 1;
	spiHw->MCR.B.PCSIS1 = 1;
	spiHw->MCR.B.PCSIS2 = 1;
	spiHw->MCR.B.PCSIS3 = 1;
	spiHw->MCR.B.PCSIS4 = 1;
	spiHw->MCR.B.PCSIS5 = 1;

	/* DMA TX FIFO fill. */
	spiHw->RSER.B.TFFF_RE = 1;
	spiHw->RSER.B.TFFF_DIRS = 1;

	/* DMA RX FIFO drain. */
	spiHw->RSER.B.RFDF_RE = 1;
	spiHw->RSER.B.RFDF_DIRS = 1;

	// Setup CTAR's channel codes..
	for(int i=0;i<7;i++) {
	  spiUnit->channelCodes[i] = NOT_VALID;
	}

	/* Force to stopped state. */
	spiHw->MCR.B.HALT = 1;

	spiHw->SR.B.EOQF = 1;

	/* Enable clocks. */
	spiHw->MCR.B.MDIS = 0;

#if defined(__DMA_INT)
	Irq_InstallVector(Spi_Isr_DMA, 16 , 1, CPU_Z1);
#endif

	// Install EOFQ int..
#if 1
	switch(unit) {
#if defined(CFG_MPC5606S)
	case 0:
		ISR_INSTALL_ISR2("SPI_A",Spi_Isr_A, DSPI_0_ISR_EOQF, 1, 0);
		break;
	case 1:
		ISR_INSTALL_ISR2("SPI_B",Spi_Isr_B, DSPI_1_ISR_EOQF, 1, 0);
		break;
#else
#error ISR NOT installed.
#endif

	}

#else
	Irq_InstallVector(Spi_Isr_Info[unit].entry, Spi_Isr_Info[unit].vector,
	                       Spi_Global.configPtr->SpiHwConfig[unit].IsrPriority, Spi_Isr_Info[unit].cpu);

#endif
}

//-------------------------------------------------------------------

static void Spi_DmaSetup(uint32 unit ) {

	Dma_TcdType *tcd;

	tcd = &Spi_Unit[unit].dmaTxTCD;
	*tcd = Spi_DmaTx;
	tcd->SADDR = (uint32)Spi_Unit[unit].txQueue;
	tcd->DADDR = (uint32)&(GET_SPI_HW_PTR(unit)->PUSHR.R);

	Dma_StopChannel(Spi_Unit[unit].dmaTxChannel);
	Dma_CheckConfig();

	// CITER and BITER set when we send
	tcd = &Spi_Unit[unit].dmaRxTCD;
	*tcd = Spi_DmaRx;
	tcd->SADDR = (uint32)&(GET_SPI_HW_PTR(unit)->POPR.R);
	tcd->DADDR = (uint32)Spi_Unit[unit].rxQueue;

