openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	Dma_StopChannel(Spi_Unit[unit].dmaRxChannel);
	Dma_CheckConfig();

}

//-------------------------------------------------------------------

void Spi_Init( const Spi_ConfigType *ConfigPtr ) {

	const Spi_JobConfigType *jobConfig2;
	Spi_Global.configPtr = ConfigPtr;
	Spi_Global.extBufPtr = Spi_Eb;
//	Spi_Global.currSeq = NOT_VALID;

	// Set all sequence results to OK
	for(Spi_SequenceType i=(Spi_SequenceType)0;i<SPI_MAX_SEQUENCE;i++) {
		Spi_SetSequenceResult(i,SPI_SEQ_OK);
	}

	// Figure out what HW controllers that are used
	for(int j=0;j<Spi_GetJobCnt();j++){
    jobConfig2 = &Spi_Global.configPtr->SpiJobConfig[j];
   	Spi_Global.spiHwConfigured |= (1<<jobConfig2->SpiHwUnit);
	}


	// Initialize controllers used
	{
		uint32 confMask;
		uint8  confNr;

		confMask = Spi_Global.spiHwConfigured;

		for (; confMask; confMask&=~(1<<confNr)) {
			confNr = ilog2(confMask);
			DEBUG(DEBUG_LOW,"%s:Configured HW controller %d\n",MODULE_NAME,confNr);
			Spi_InitController(confNr);
			Spi_SetHWUnitStatus(confNr,SPI_IDLE);

			// DMA init...
			//

			/* Make sure that this channel shall be used. */
      assert (ConfigPtr->SpiHwConfig[confNr].Activated);

      Spi_Unit[confNr].dmaTxChannel = ConfigPtr->SpiHwConfig[confNr].TxDmaChannel;
			Spi_Unit[confNr].dmaRxChannel = ConfigPtr->SpiHwConfig[confNr].RxDmaChannel;
			Spi_DmaSetup(confNr);

		}
	}


	/* Setup CTARS, configuration */
	{
	  Spi_UnitType *spiUnit;

	  int j = 0;
	  int k;
	  int l;
	  uint32 channelCode;
	  int channelIndex;

	  const Spi_JobConfigType *jobConfig;
	  const Spi_ChannelConfigType *chConfig;

	  for(j=0;j<Spi_GetJobCnt();j++){
	    jobConfig = &Spi_Global.configPtr->SpiJobConfig[j];
	    spiUnit = GET_SPI_UNIT_PTR( jobConfig->SpiHwUnit );

	    // Also find the controllers used while we are at it
	    Spi_Global.spiHwConfigured |= (1<<jobConfig->SpiHwUnit);

	    // ..and set the job status
	    Spi_SetJobResult((Spi_JobType)j,SPI_JOB_OK);

	    l=0;
	    // Go through all the jobs and it's channels to setup CTAS
	    // A job have the same physical controller ( SpiHwUnit )
	    while( (channelIndex = jobConfig->ChannelAssignment[l++]) != NOT_VALID) {
	      chConfig = &Spi_Global.configPtr->SpiChannelConfig[channelIndex];

	      // Form a channel code from
        // <external_device_id><channel width>
	      channelCode = ((jobConfig->DeviceAssignment<<8) +  chConfig->SpiDataWidth);

	      for(k=0;k<7;k++) {
	        if( spiUnit->channelCodes[k] == channelCode ) {
	        	Spi_ChannelInfo[channelIndex].ctarId = k;
	        	DEBUG(DEBUG_LOW,"%s: Channel %d re-uses CTAR %d@%d . device=%d,width=%d\n",MODULE_NAME,channelIndex,k,jobConfig->SpiHwUnit,jobConfig->DeviceAssignment,chConfig->SpiDataWidth);
	          // already in list, break
	          break;
	        }

	        if( spiUnit->channelCodes[k] == NOT_VALID) {
	          // Add to list
	          spiUnit->channelCodes[k] = channelCode;
	          // Assign the CTAR index to channel info..
	          DEBUG(DEBUG_LOW,"%s: Channel %d uses    CTAR %d@%d . device=%d,width=%d\n",MODULE_NAME,channelIndex,k,jobConfig->SpiHwUnit,jobConfig->DeviceAssignment,chConfig->SpiDataWidth);

	          Spi_SetupCTAR(  jobConfig->SpiHwUnit,
	        		  	  	  Spi_GetExternalDevicePtrFromIndex( jobConfig->DeviceAssignment ),
	        		  	  	  (Spi_ChannelType)k,
	                          chConfig->SpiDataWidth );

	          Spi_ChannelInfo[channelIndex].ctarId = k;
	          break;
	        }
	      }
	    }
	  }
	}

	Spi_Global.initRun = TRUE;
}

//-------------------------------------------------------------------

Std_ReturnType Spi_DeInit( void ){
  volatile struct DSPI_tag *spiHw;
  uint32 confMask;
  uint8  confNr;

  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_DEINIT_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
  if( Spi_GetStatus()==SPI_BUSY )
    return E_NOT_OK;

  // Disable the HW modules ( SPI021 )
  confMask = Spi_Global.spiHwConfigured;

  // Disable the SPI hw
  for (; confMask; confMask&=~(1<<confNr)) {
    confNr = ilog2(confMask);
    spiHw = GET_SPI_HW_PTR(confNr);
    // Disable the hardware..
    spiHw->MCR.B.MDIS = 1;

    Spi_InitController(confNr);
    Spi_SetHWUnitStatus(confNr,SPI_IDLE);
  }

  // SPI022
  Spi_Global.configPtr = NULL;
  Spi_Global.initRun = FALSE;


	return E_OK;
}

//-------------------------------------------------------------------

/**
 * Write a job to the SPI bus
 *
 * @param jobIndex The job to write to the SPI bus
 */
static void Spi_JobWrite( Spi_JobType jobIndex ) {

	const Spi_JobConfigType *jobConfig;
	const Spi_ChannelConfigType *chConfig;
	Spi_EbType *extChBuff;
	Spi_CommandType cmd;
	Spi_UnitType *spiUnit;

	int k = 0;
	int j = 0;
	int channelIndex;
	volatile struct DSPI_tag *spiHw;

	cmd.R = 0;

	// Grab some things that may be of use..
	jobConfig = &Spi_Global.configPtr->SpiJobConfig[jobIndex];
	spiUnit = GET_SPI_UNIT_PTR( jobConfig->SpiHwUnit );

	// Be really sure that we are done with previous send
	spiHw = GET_SPI_HW_PTR(jobConfig->SpiHwUnit);

	spiUnit->txCurrIndex = 0;
	spiUnit->currJob = jobConfig;

	Spi_SetHWUnitStatus(jobConfig->SpiHwUnit,SPI_BUSY);
	Spi_SetJobResult(jobIndex,SPI_JOB_PENDING);

	j = 0;

	// Find the channels for this job
	while( (channelIndex = jobConfig->ChannelAssignment[j++]) != NOT_VALID)
	{
		chConfig = &Spi_Global.configPtr->SpiChannelConfig[channelIndex];

    /* Check configuration error */
#if ( SPI_CHANNEL_BUFFERS_ALLOWED == 1  )
    assert( chConfig->SpiChannelType == SPI_EB );
#endif

		// Send the channels that are setup with external buffers
		// Get the external buffer for this channel
		extChBuff = &Spi_Global.extBufPtr[channelIndex];

		if( extChBuff->active == 0 ) {
			LDEBUG_PRINTF("Err:External buffer %d@job %d not setup\n",channelIndex,jobIndex);
			assert(0);
		}

		// Start to fill the SPI queue for the DMA:
		for(k=0;k<extChBuff->length;k++) {
      uint32 csId = Spi_Global.configPtr->SpiExternalDevice[jobConfig->DeviceAssignment].SpiCsIdentifier;
      // Build cmd
      cmd.B.CONT = 1; // Channels should keep CS active
																// ( A job must assert CS continuously)
			cmd.R |= (1 <<(16+csId)); // Set PCS
			cmd.B.EOQ = 0;
			cmd.B.CTAS = Spi_ChannelInfo[channelIndex].ctarId;
			if( extChBuff->src != NULL ) {
				if( chConfig->SpiDataWidth > 8 ) {
					cmd.B.TXDATA = (extChBuff->src[k]<<8)+(extChBuff->src[k+1]&0xff);
					k++;
				} else {
					cmd.B.TXDATA = extChBuff->src[k];
				}
			} else {
				cmd.B.TXDATA = chConfig->SpiDefaultData;
			}

			// Just keep on filling the tx queue
			spiUnit->txQueue[spiUnit->txCurrIndex++].R = cmd.R;
		}
	} /*while( channelIndex == */

	// send last part
	cmd.B.CONT = 0;		// CS high
	cmd.B.EOQ = 1;		// last in queue
	spiUnit->txQueue[--spiUnit->txCurrIndex].R = cmd.R;

	// Set the length of the data to send
	spiUnit->dmaTxTCD.CITER = spiUnit->txCurrIndex + 1;
	spiUnit->dmaTxTCD.BITER = spiUnit->txCurrIndex + 1;

