openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	Spi_Global.totalNbrOfStartedJobs++;

	ramlog_str("Job: ");
	ramlog_dec(jobIndex);
	ramlog_str(" Cnt: ");
	ramlog_dec(spiUnit->txCurrIndex+1);
	ramlog_str("\n");

	DEBUG(DEBUG_LOW,"%s:Tx Job:%d cnt:%d first data:%04x\n",MODULE_NAME,jobIndex,spiUnit->txCurrIndex+1,spiUnit->txQueue[0].B.TXDATA);

	{
		uint32 unit = jobConfig->SpiHwUnit;

		Spi_UnitType *spiUnit =	GET_SPI_UNIT_PTR(unit);
		volatile struct DSPI_tag *spiHw = GET_SPI_HW_PTR(unit);


		Dma_ConfigureChannel ((Dma_TcdType *)&spiUnit->dmaTxTCD, spiUnit->dmaTxChannel);
		Dma_ConfigureChannel ((Dma_TcdType *)&spiUnit->dmaRxTCD, spiUnit->dmaRxChannel );
		/* Flush TX/Rx FIFO.  Ref. man. 23.5.1 step 8 */
		spiHw->MCR.B.CLR_RXF = 1;
		spiHw->MCR.B.CLR_TXF = 1;

		Dma_StartChannel (spiUnit->dmaRxChannel);
		Dma_StartChannel (spiUnit->dmaTxChannel);

		// Step 9. Clear TCNT
		spiHw->TCR.B.SPI_TCNT = 0;

		if( ( Spi_Global.asyncMode == SPI_INTERRUPT_MODE ) &&
		  ( spiUnit->callType == SPI_ASYNC ) )
		{
			ENABLE_EOQ_INTERRUPT(spiHw);
		} else {
			DISABLE_EOQ_INTERRUPT(spiHw);
		}

	  /* This will trig a new transfer. Ref. man. 23.5.1 step 11 */
	  spiHw->SR.B.EOQF = 1;
	  spiHw->MCR.B.HALT = 0;

		// Since it's not obvious on how to tell when a SPI sequence
		// is sent, keep things below to what things have been tested.
	#if defined(STEP_VALIDATION)
#if 0
		/* Wait for transfer to complete. */
		while (!spiHw->SR.B.EOQF) {
			Spi_Global.eoqf_cnt++;
			Spi_Global.dma_status = EDMA.ES.R;
		}
	    while (spiHw->SR.B.TXRXS)	{	Spi_Global.txrxs_cnt++;}
		while( EDMA.TCD[spiUnit->dmaRxChannel].ACTIVE ) {;}
#endif

	#endif

	}

}

void Spi_PrintSeqInfo(const Spi_SequenceConfigType *seqConfigPtr ) {
  int i=0;
  uint32 job;
  DEBUG(DEBUG_HIGH,"%s: Seq: %d:",MODULE_NAME,seqConfigPtr->SpiSequenceId);

  while( (job = seqConfigPtr->JobAssignment[i]) != (-1) ) {
    DEBUG(DEBUG_HIGH,"%d ",job);
    i++;
  }
  DEBUG(DEBUG_HIGH,"\n");
}


/**
 * Write a sequence to the SPI bus
 *
 * @param seqIndex The sequence
 * @param sync 1 - make the call sync. 0 - make the call async
 */
static void Spi_SeqWrite( Spi_SequenceType seqIndex, Spi_CallTypeType sync ) {

	const Spi_SequenceConfigType *seqConfig;
	const Spi_JobConfigType *jobConfig;
	Spi_UnitType *spiUnit;
	Spi_JobType jobIndex;


	seqConfig = Spi_GetSeqPtrFromIndex(seqIndex);
	jobIndex = seqConfig->JobAssignment[0];
	jobConfig = Spi_GetJobPtrFromIndex(jobIndex);

	spiUnit = Spi_GetUnitPtrFromIndex(jobConfig->SpiHwUnit);
	// Fill in the required fields for job and sequence..
	spiUnit->currJobIndexPtr = &seqConfig->JobAssignment[0];
	spiUnit->callType = sync;
	spiUnit->currSeqPtr = seqConfig;

	Spi_SetSequenceResult(seqIndex, SPI_SEQ_PENDING);

	// Setup interrupt for end of queue
	if( ( Spi_Global.asyncMode == SPI_INTERRUPT_MODE ) &&
	    ( spiUnit->callType == SPI_ASYNC ) )
	{
	  DEBUG(DEBUG_MEDIUM,"%s: async/interrupt mode\n",MODULE_NAME);
	} else {
	  DEBUG(DEBUG_MEDIUM,"%s: sync/polled mode\n",MODULE_NAME);
	}

#if defined(USE_LDEBUG_PRINTF) && ( DEBUG_LVL <= DEBUG_HIGH )
	Spi_PrintSeqInfo( seqConfig );
#endif

	Spi_JobWrite(jobIndex);

	if( spiUnit->callType == SPI_SYNC ) {
	  while( Spi_GetSequenceResult(seqIndex) == SPI_SEQ_PENDING ) {
	    Spi_Isr(jobConfig->SpiHwUnit);
	  }
	}

}

//-------------------------------------------------------------------
static _Bool Spi_AnyPendingJobs(Spi_SequenceType Sequence ) {

  // Check that we don't share any jobs with another sequence that is SPI_SEQ_PENDING
  for(int i=0;i<SPI_MAX_SEQUENCE;i++) {
    if( i==Sequence ) {
      continue;
    }

    if( Spi_GetSequenceResult(i) == SPI_SEQ_PENDING ) {
      // We have found a pending sequence... check that we don't share any jobs
      // with that sequence, SPI086
      if( Spi_ShareJobs(Sequence,i) ) {
        return 1;
      }
    }
  }

  return 0;
}

//-------------------------------------------------------------------

Std_ReturnType Spi_SyncTransmit( Spi_SequenceType Sequence ) {

  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_SYNCTRANSMIT_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
  VALIDATE_W_RV( ( SPI_MAX_SEQUENCE>Sequence ), SPI_SYNCTRANSMIT_SERVICE_ID, SPI_E_PARAM_SEQ, E_NOT_OK );
	Std_ReturnType rv = E_OK;

  if( Spi_GetSequenceResult(Sequence) == SPI_SEQ_PENDING  ) {
		DEBUG(DEBUG_LOW,"%s: Spi_AsyncTransmit() is PENDING\n",MODULE_NAME);
  	return E_NOT_OK;		// SPI157
  }

  assert(Spi_GetSequenceResult(Sequence) == SPI_SEQ_OK);

  if( Spi_AnyPendingJobs(Sequence) ) {
    return E_NOT_OK;
  }

  Spi_SeqWrite(Sequence, SPI_SYNC );

	return rv;
}


//-------------------------------------------------------------------

Std_ReturnType Spi_AsyncTransmit( Spi_SequenceType        Sequence ) {
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_ASYNCTRANSMIT_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
  VALIDATE_W_RV( ( SPI_MAX_SEQUENCE>Sequence ), SPI_ASYNCTRANSMIT_SERVICE_ID, SPI_E_PARAM_SEQ, E_NOT_OK );

  if( Spi_GetSequenceResult(Sequence) == SPI_SEQ_PENDING  ) {
		DEBUG(DEBUG_LOW,"%s: Spi_AsyncTransmit() is PENDING\n",MODULE_NAME);
  	return E_NOT_OK;		// SPI157
  }

  assert(Spi_GetSequenceResult(Sequence) == SPI_SEQ_OK);

  if( Spi_AnyPendingJobs(Sequence) ) {
    return E_NOT_OK;
  }

	DEBUG(DEBUG_LOW,"%s: Starting seq: %d\n",MODULE_NAME,Sequence);

	Spi_SeqWrite(Sequence, SPI_ASYNC );

	return E_OK;
}


//-------------------------------------------------------------------


Std_ReturnType Spi_ReadIB( Spi_ChannelType Channel, Spi_DataType *const DataBufferPtr ) {
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_READIB_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
  VALIDATE_W_RV( ( Channel<SPI_MAX_CHANNEL ), SPI_READIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
  VALIDATE_W_RV( ( SPI_IB<Spi_Global.configPtr->SpiChannelConfig[Channel].SpiChannelType ),\
      SPI_READIB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );

  /* NOT SUPPORTED */

	Std_ReturnType rv = E_NOT_OK;
	return rv;
}

//-------------------------------------------------------------------

Std_ReturnType Spi_SetupEB( Spi_ChannelType Channel,
							const Spi_DataType*  SrcDataBufferPtr,
	     					Spi_DataType*	DesDataBufferPtr,
	     					Spi_NumberOfDataType Length )
{
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_SETUPEB_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );
  VALIDATE_W_RV( ( Channel<SPI_MAX_CHANNEL ), SPI_SETUPEB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
#if ( SPI_CHANNEL_BUFFERS_ALLOWED == 1 )
  VALIDATE_W_RV( ( SPI_EB==Spi_Global.configPtr->SpiChannelConfig[Channel].SpiChannelType ),\
      SPI_SETUPEB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );
#endif
// SPI067
  VALIDATE_W_RV( ( Length<=Spi_Global.configPtr->SpiChannelConfig[Channel].SpiEbMaxLength ),\
      SPI_SETUPEB_SERVICE_ID, SPI_E_PARAM_CHANNEL, E_NOT_OK );

	Spi_EbType *extChBuff= &Spi_Global.extBufPtr[Channel];
	const Spi_ChannelConfigType *chConfig = &Spi_Global.configPtr->SpiChannelConfig[Channel];

	if( chConfig->SpiChannelType == SPI_EB ) {
		extChBuff->src = SrcDataBufferPtr;
		extChBuff->dest = DesDataBufferPtr;
		extChBuff->length = Length;
		extChBuff->active = 1;
	} else {
		/* NOT SUPPORTED */
		assert(0);
		while(1) ;
	}

	return E_OK;
}

//-------------------------------------------------------------------

Spi_StatusType Spi_GetStatus( void ) {
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETSTATUS_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );

	if( !Spi_Global.initRun ) {
		return SPI_UNINIT;
	}

