openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Spi.c
	// Check all sequences if they have any job pending
	for(int i=0;i<SPI_MAX_SEQUENCE;i++) {
		if( Spi_GetSequenceResult(i)==SPI_SEQ_PENDING ) {
			return SPI_BUSY;
		}
	}

	return SPI_IDLE;
}

//-------------------------------------------------------------------


Spi_JobResultType Spi_GetJobResult ( Spi_JobType       Job ) {
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETJOBRESULT_SERVICE_ID, SPI_E_UNINIT, SPI_JOB_FAILED );
  VALIDATE_W_RV( ( SPI_MAX_JOB<Job ), SPI_GETJOBRESULT_SERVICE_ID, SPI_E_PARAM_JOB, SPI_JOB_FAILED );

	return Spi_JobUnit[Job].jobResult;
}

//-------------------------------------------------------------------


Spi_SeqResultType Spi_GetSequenceResult(Spi_SequenceType Sequence ) {
	Spi_SeqResultType rv;

  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETSEQUENCERESULT_SERVICE_ID, SPI_E_UNINIT, SPI_SEQ_FAILED );
  VALIDATE_W_RV( ( SPI_MAX_SEQUENCE>Sequence ), SPI_GETSEQUENCERESULT_SERVICE_ID, SPI_E_PARAM_SEQ, SPI_SEQ_FAILED );

  rv = Spi_SeqUnit[Sequence].seqResult;

	return rv;
}

//-------------------------------------------------------------------

Spi_StatusType Spi_GetHWUnitStatus(Spi_HWUnitType        HWUnit) {
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_GETHWUNITSTATUS_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );

	return Spi_Unit[HWUnit].status;
}

//-------------------------------------------------------------------

#if (SPI_CANCEL_API == STD_ON )
void Spi_Cancel( Spi_SequenceType Sequence ) {
  VALIDATE( ( TRUE == Spi_Global.initRun ), SPI_CANCEL_SERVICE_ID, SPI_E_UNINIT );
  VALIDATE( ( SPI_MAX_SEQUENCE<Sequence ), SPI_CANCEL_SERVICE_ID, SPI_E_PARAM_SEQ );

  /* NOT SUPPORTED */
}
#endif

//-------------------------------------------------------------------


#if ( SPI_LEVEL_DELIVERED == 2) // SPI154

Std_ReturnType Spi_SetAsyncMode( Spi_AsyncModeType        Mode ) {
  VALIDATE_W_RV( ( TRUE == Spi_Global.initRun ), SPI_SETASYNCMODE_SERVICE_ID, SPI_E_UNINIT, E_NOT_OK );

  // Note!
  // Not really sure by whom this function is supposed to be called by.
  // The users of SPI(e2,flash,etc) should probably not use this.

  for(int i=0;i<SPI_MAX_SEQUENCE;i++) {
    if( Spi_GetSequenceResult(i) == SPI_SEQ_PENDING ) {
      return E_NOT_OK;
    }
  }

  Spi_Global.asyncMode = Mode;

	return E_OK;
}
#endif

//-------------------------------------------------------------------

void Spi_MainFunction_Handling( void ) {
  /* NOT SUPPORTED */
}

//-------------------------------------------------------------------

void Spi_MainFunction_Driving( void ) {
  volatile struct DSPI_tag *spiHw;
  uint32 confMask;
  uint8  confNr;
  Spi_UnitType *spiUnit;

  // TODO: check that the queue is empty.. if so do the next job.
  if( Spi_Global.asyncMode == SPI_POLLING_MODE ) {
    confMask = Spi_Global.spiHwConfigured;

    for (; confMask; confMask&=~(1<<confNr)) {
      confNr = ilog2(confMask);
      spiHw = GET_SPI_HW_PTR(confNr);

      if( Spi_GetHWUnitStatus(confNr) == SPI_BUSY ) {
        if (spiHw->SR.B.TXRXS) {
          // Still not done..
         } else {
           spiUnit = GET_SPI_UNIT_PTR(confNr);
           Spi_Isr(confNr);
         }
      }
    }
  }
}


